"""
NAME: data_type_list.py <br/>
Description: Python 列表数据类型 <br/>
@author ranyk <br/>
@version V1.0 <br/>
@date 2023-02-02
"""

# 列表对象的定义和初始化
one = ['a', "b", 3, True, complex(1, 3), 1.3]
two = ['c', [1, 2.0]]

# 输出 one 列表, 输出结果为: ['a', 'b', 3, True, (1+3j), 1.3]
print(one)
# 输出 one 列表中第二个元素,输出结果为: b
print(one[1])
# 输出截取 one 列表第 1~3 个元素,输出结果为: ['a', 'b', 3]
print(one[0:3])
# 输出截取 one 列表第 3~结尾的元素,输出结果为: [3, True, (1+3j), 1.3]
print(one[2:])
# 输出两次 one 列表,输出结果为: ['a', 'b', 3, True, (1+3j), 1.3, 'a', 'b', 3, True, (1+3j), 1.3]
print(one * 2)
# 输出 one 和 two 列表,输出结果为: ['a', 'b', 3, True, (1+3j), 1.3, 'c', [1, 2.0]]
print(one+two)

# 改变列表 one 中的元素值,输出结果为:
'''
改变第一个元素前的列表值为:  ['a', 'b', 3, True, (1+3j), 1.3]
改变第一个元素后的列表值为:  ['a', 5, 3, True, (1+3j), 1.3]
'''
print("改变第二个元素前的列表值为: ", one)
one[1] = 5
print("改变第二个元素后的列表值为: ", one)

# 列表截取,增加步长参数,步长参数意义在于从开始截取的下一个元素算起,到第几个为下一个需要的元素, 输出结果为: [5, (1+3j)]
print(one[1:5:3])

# 列表的倒序输出,输出结果为:
'''
倒序前序列 one 的值为:  ['a', 5, 3, True, (1+3j), 1.3]
倒序后序列 one 的值为:  [1.3, (1+3j), True, 3, 5, 'a']
'''
print("倒序前序列 one 的值为: ", one)
print("倒序后序列 one 的值为: ", one[-1::-1])
